Revit 2027 API
PartUtils.GetChainLengthToOriginal Method
 Calculates the length of the longest chain of divisions/merges to reach to an original non-Part element that is the source of the tested part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static int GetChainLengthToOriginal(
	Part part
)
Public Shared Function GetChainLengthToOriginal (
	part As Part
) As Integer
public:
static int GetChainLengthToOriginal(
	Part^ part
)
static member GetChainLengthToOriginal :
        part : Part -> int
Parameters
part Part
 The part to be tested
Return Value
Int32
 The length of the longest chain.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PartUtils Class
Autodesk.Revit.DB Namespace